""""
n - кількість вимірів простору
а - список елементів вектора
dob - добуток всіх від'ємних елементів вектора
counter - кількість всіх від'ємних елементів вектора
"""
n = int(input("Ввести вимірність простору  :  "))#введення вимірності простору
a = list()  # створення списку
dob = 1
counter = 0
for i in range(1, n+1):
    a.append(float(input("Введіть значення для {0} - го елемента вектора:   ".format(i))))   #додавання до списку елементів вектора
for i in range(len(a)):
    if a[i] < 0:     #обчислення добутку від'ємних елементів вектора
        dob = dob*a[i]
        counter += 1
if  counter == 0:     #якщо від'ємних елементів у векторі 0 - вивести, що добуток дорівнює 0
    dob = 0
print("Добуток від'ємних елементів вектору дорівнює:   {0}".format(dob))