""""
a = float, довжина сторони ромба
x = float, значення кута ромба
p = периметр ромба
s = площа ромба
"""
import math as m
a = float(input('Введіть довжину сторони ромба  :  '))
while a <= 0:
    a = float(input('Ромб не може мати такої сторони. Введіть значення ще раз  : '))
x = float(input('Введіть значення кута в радіанах   :  '))
while x >= m.pi or x <= 0:
    x = float(input('Ромб не може мати такого кута. Введіть будь ласка значення кута ще раз  :  '))
p = 4*a
s = abs(m.sin(x))*(a**2)
print('Периметр ромба  :  {0}'.format(p))
print('Площа ромба  : {0}'.format(s))
