"""
 х, у -  координати вектора
 a -  1-а сторона трикутника
 b - 2-а сторона трикутника
 c - 3-я сторона трикутника
 maxi - найбільша сторона трикутника
 """

import math as m
x1, y1 = float(input("Введіть координату х для першого вектора:  ")), float(input("Введіть координату у для першого вектора:  "))
x2, y2 = float(input("Введіть координату х для другого вектора:  ")), float(input("Введіть координату у для другого вектора:  "))#Ввід координат
x3, y3 = float(input("Введіть координату х для третього вектора:  ")), float(input("Введіть координату у для третього вектора:  "))
a = m.sqrt((x1-x2)**2 + (y1-y2)**2)
b =  m.sqrt((x2-x3)**2 + (y2-y3)**2)       #Обчислення сторін
c =  m.sqrt((x1-x3)**2 + (y1-y3)**2)
if a >= b:          #Порівняння сторін а та b
    maxi = a
else:
    maxi = b
if b >= c:          #порівняння сторін b i c
    maxi = b
else:
    maxi = c
print("Найдовша сторона трикутника  -   {0}".format(maxi))