'''''
n - будь-яке натуральне число
sum - сума всіх цифр числа 
counter - кількість всіх цифр числа
sra - середнє арифметичне всіх цифр числа
count - кількість всіх цифр, що менші за середнє арифметичне вказаного числа
'''''
n = int(input("Введіть будь-яке натуральне число:   "))   #Введення будь-якого натурального числа
if n >= 10:
    counter = 0
    suma = 0
    while n > 0:    #Знаходження по-черзі всі цифри вказаного числа і знаходження їх суми
        suma += n % 10
        n = n//10
        counter += 1
    sra = suma / counter     # знаходження середнього арифметичного всіх цифр числа
    if sra%1 != 0:
        count = sra//1     #знаходження кількості цифр, що менші за середнє арифметичне введеного числа
    else:
        count = sra - 1
    print(count)
else:
    print(n-1)