'''''
x - градусна міра кута
n - значення для степеня та кыількості повторів
sum - сума
'''''
import math as m  #імпортування модуля math
x = (float(input('Введіть значення для кута в радіанах:   ')))         #оголошення змінної х
n = int(input("Введіть значення для степеня та кількості повторів:   "))  #оголошення змінної n
sum = 0    #початкове значення суми
for i in range(1, n+1):      #  оголошення  циклу з параметром
    sum += (m.sin(x))**i   # обчислення суми
print("Результатом буде : {0}".format(sum))